In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../../data/경사도/최종_공원_100m_버퍼_경사도.csv')

In [3]:
df.head()

,fid,DN,area,fid_2,SIG_CD,KOR_PAR_NM,PARK_SN,면적(m^2,x,y,ADM_DR_NM
0,50424,2,100,12841,11500,부석공원,88.0,1137,126.798879,37.582895,방화2동
1,50425,7,100,12841,11500,부석공원,88.0,1137,126.798879,37.582895,방화2동
2,50426,12,400,12841,11500,부석공원,88.0,1137,126.798879,37.582895,방화2동
3,50645,3,100,12841,11500,부석공원,88.0,1137,126.798879,37.582895,방화2동
4,50646,8,100,12841,11500,부석공원,88.0,1137,126.798879,37.582895,방화2동

In [24]:
df_elevation = df.groupby('PARK_SN', as_index=False)['DN'].mean()
df_elevation.head()

   PARK_SN        DN
0      1.0  1.000000
1      2.0  1.000000
2      3.0  0.500000
3      4.0  1.833333
4      5.0  0.500000

In [23]:
df.groupby('PARK_SN', as_index=False)['DN'].mean().value_counts()

PARK_SN  DN
1.0      1.000000     1
91.0     1.000000     1
87.0     1.250000     1
85.0     0.000000     1
84.0     0.000000     1
                     ..
35.0     5.360656     1
34.0     11.516779    1
33.0     1.222222     1
32.0     6.283465     1
138.0    0.500000     1
Length: 106, dtype: int64

In [27]:
df_elevation['PARK_SN'] = df_elevation['PARK_SN'].astype(int)

In [30]:
df_elevation['DN'] = np.round(df_elevation['DN'], 2)
df_elevation['DN']

0      1.00
1      1.00
2      0.50
3      1.83
4      0.50
       ...
101    2.00
102    0.00
103    0.00
104    0.00
105    0.50
Name: DN, Length: 106, dtype: float64

In [31]:
df_elevation

     PARK_SN    DN
0          1  1.00
1          2  1.00
2          3  0.50
3          4  1.83
4          5  0.50
..       ...   ...
101      133  2.00
102      134  0.00
103      135  0.00
104      137  0.00
105      138  0.50

[106 rows x 2 columns]

In [32]:
df_elevation.to_csv('../../data/경사도/최종_공원_경사도_fix.csv', encoding='euc-kr', index=False)